def solve_equation(c1, c2, c3, c4, pw, solve_last_poly=False):
    '''
    TODO: 这个文件的能力是 solve_sqrt236.sage 的子集，这里仅作为教程保留
    解方程`(a+b*sqrt(2)+c*sqrt(3))^pw == c1+c2*sqrt(2)+c3*sqrt(3)+c4*sqrt(6)`

    :param c1: 常数项
    :param c2: 根号2的系数
    :param c3: 根号3的系数
    :param c4: 根号6的系数
    :param pw: 幂
    :param solve_last_poly: 是否尝试解Grobner基的最后一个元素的方程
    '''
    S.<a, b, c, s2, s3> = PolynomialRing(QQ, order='lex')
    I = S.ideal([s2 ^ 2 - 2, s3 ^ 2 - 3])
    Quo = S.quotient(I)
    expr = Quo(a + b * s2 + c * s3)
    expanded = expr ^ pw
    rep = expanded.lift()
    # 现在 rep 是 a, b, c, s2, s3 的多项式，其中 s2, s3 次数 <= 1
    v1 = rep.coefficient({s2: 0, s3: 0})
    v2 = rep.coefficient({s2: 1, s3: 0})
    v3 = rep.coefficient({s2: 0, s3: 1})
    v4 = rep.coefficient({s2: 1, s3: 1})
    G = ideal(v1 - c1, v2 - c2, v3 - c3, v4 - c4).groebner_basis()
    print(G)
    last_var_poly = G[-1].factor()
    print(last_var_poly)
    if solve_last_poly:
        sols = solve(SR(last_var_poly), SR(c))
        print(sols)


def eq1_conclusion():
    b, c = var('b, c')
    eq = b - 1181561441990592179994624 / 81603407194823067105148265404899470482484375 * c ^ 21 + 35245440741196617302016 / 7892608445069503519090587539049078125 * c ^ 16 - 46707250582742167225531735007583744 / \
        81603407194823067105148265404899470482484375 * c ^ 11 + 324355906824664483820669085470016 / 7892608445069503519090587539049078125 * c ^ 6 - 1760122403888730313240723940820939341615815741 / 734430664753407603946334388644095234342359375 * c
    eq_sub = eq.subs({c: 9})
    print(eq_sub)  # b - 11


def eq2_conclusion():
    b, c = var('b, c')
    eq = b + 133499286575198878625564335276032 / 48356650965537404760532572501026687408268970488956181754528505 * c ^ 31 - 437160298923518417525035950530890825728 / 48356650965537404760532572501026687408268970488956181754528505 * c ^ 25 + 2308930146776356347363301121122751099590496256 / 183755273669042138090023775503901412151422087858033490667208319 * c ^ 19 - \
        2532802265459246287004641431718651681311387971373568 / 261125915213901985706875891505544112004652440640363381474453927 * c ^ 13 + 12421861495699225767169124748610490559803523996862140970057 / 2611259152139019857068758915055441120046524406403633814744539270 * c ^ 7 - 37917622176631976446499167875710503450442100746398622874916088699 / 16537974630213792428102139795351127093627987907223014160048748710 * c
    eq_sub = eq.subs({c: 9})
    print(eq_sub)  # b - 11


solve_equation(0, 10360559, 8459361, 0, 5)
solve_equation(456335045, 0, 0, 186298002, 6)
solve_equation(181447, 125007, 96538, 66360, 5)
solve_equation(-296, 224, 184, -120, 5)
# 前两个例子分别是 (11 * sqrt2 + 9 * sqrt3) ^ 6, (11 * sqrt2 + 9 * sqrt3) ^ 5
# 后两个例子的Grobner基很简单： [a - 7/2*c, b - 3/2*c, c^5 - 32] [a + c, b - c, c^5 - 1]
# 分别解出 (7, 3, 2) (-1, 1, 1)
print('-' * 10 + ' 人工写代码解Grobner基给我们的方程 ' + '-' * 10)
eq1_conclusion()
eq2_conclusion()
